app/controllers/api/app_login_controller.rb

INSERT INTO "users" ("authentication_token", "created_at", "current_sign_in_at", "current_sign_in_ip", "fb_access_token", "last_sign_in_at", "last_sign_in_ip", "remember_created_at", "sign_in_count", "uid", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    uid = params[:uid]
    fb_access_token = params[:fb_access_token]
    if request.format != :json
      render :status=>406, :json=>{:message=>"The request must be json"}
      return
    end

    if uid.nil?
      render :status=>400,
              :json=>{:message=>"Missing UID"}
      return
    end

    if fb_access_token.nil?
      render :status=>400,
              :json=>{:message=>"Missin Facebook Access Token"}
      return
    end

    @user=User.find_by(user_uid: uid.downcase)

    if @user.nil? #if USER is new
      @user = User.create_new(uid, fb_access_token)

UPDATE "users" SET "authentication_token" = 'T2fz8kwGnydU8z5yYxBj', "updated_at" = '2013-01-11 20:14:23.746642' WHERE "users"."id" = 1
---
    else
      @user.ensure_authentication_token!
      render :status=>200, :json=>{:thanxup_token=>@user.authentication_token}
      @user.update_fb_token(fb_access_token)